package main 


import (
	"fmt"
)

// array数组练习题
// 1. 求数组[1, 3, 5, 7, 8]所有元素的和
// 找出数组中和为指定值的两个元素的下标，比如从数组[1, 3, 5, 7, 8]中找出和为8的两个元素的下标分别为(0,3)和(1,2)。

func main(){
// 1. 求数组[1, 3, 5, 7, 8]所有元素的和
arr :=[...]int{1, 3, 5, 7, 8}
sum:=0
for  _,v:=range arr {
   sum=sum+v
 }
 fmt.Println(sum) // 24


	// 找出和为8的两个元素的下标分别为(0,3)和(1,2)
	// 定义两个for循环，外层的从第一个开始遍历
	// 内层的for循环从外层后面的哪个开始找
	// 它们两个数的和为8

	for i:=0;i<len(arr);i++{
		for j:=i+1;j<len(arr);j++{
		if arr[i] + arr[j] == 8 {
			fmt.Printf("(%d, %d)\n", i, j)
		}	
		}
	}

}

/**
			24
			(0, 3)
			(1, 2)
*/